family_book = {'Сидоров Никита': 35,
               'Давыдова Анастасия': 43,
               'Давыдов Валентин': 13,
               'Бебриков Леонид':45,
               'Сидорова Алина':10,
               'Дрипов Насвай': 10,
               'Мамут рахал': 1035,
               'Артемка Про': 228,
               'Сидорова Елена':34,
               'Кокс В Ноздре': 123
}

last_n = input('введите фамилию')

for name,age in family_book.items():
    if last_n in name:
        print(name,age)